# Программа принимает на вход число, на выход выдает его квадрат.
# Задача 0

num = int(input('Введите число: '))
#num = int(num)
print(f'Квадрат {num} = {num**2}')
